<template>
  <div>
    <div class="nv-box-white nv-mt-40">
      <div class="row box-home-novel">
        <div class="section-header">
          <h4>นโยบายความเป็นส่วนตัว</h4>
        </div>
        <div class="col">
          บริษัท คิงด้อม แพลตฟอร์ม จำกัด
          เล็งเห็นถึงความสำคัญของการคุ้มครองข้อมูลส่วนบุคคล
          บริษัทจึงได้มีมาตรการเพื่อจัดการและปกป้องข้อมูลของท่านอย่างเหมาะสม
          เพื่อให้ท่านมั่นใจได้ว่าข้อมูลส่วนบุคคลที่ท่านให้ไว้จะถูกนำไปใช้อย่างเหมาะสมและถูกต้องตามกฎหมาย
          นโยบายฉบับนี้ถูกจัดทำขึ้นเพื่อแจ้งให้ท่านซึ่งเป็นเจ้าของข้อมูลส่วนบุคคลทราบถึงวัตถุประสงค์และรายละเอียดของการเก็บรวบรวม
          ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน
          รวมถึงสิทธิอันพึงมีของท่านตามพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
          2562
          <h4 class="mt-4">ความหมายของข้อมูลส่วนบุคคล</h4>
          <p>
            “ข้อมูลส่วนบุคคล” หมายถึง
            ข้อมูลใดๆที่ระบุไปถึงตัวบุคคลของเจ้าข้อมูลได้
            ไม่ว่าทางตรงหรือทางอ้อม
          </p>
          <h4 class="mt-4">บริษัทเก็บข้อมูลอะไรบ้าง</h4>
          <p>
            ข้อมูลส่วนตัว ได้แก่ ชื่อ-นามสกุล วันเดือนปีเกิด และสำเนาบัตรประชาชน
            (กรณีที่ท่านลงทะเบียนเป็นนักเขียน)
          </p>
          <p>
            ข้อมูลเพื่อการติดต่อ ได้แก่ หมายเลขโทรศัพท์ อีเมล และที่อยู่
          </p>
          <p>
            ข้อมูลทางการเงิน ได้แก่ ข้อมูลบัญชีธนาคาร และสำเนาสมุดบัญชีธนาคาร
            (กรณีที่ท่านลงทะเบียนเป็นนักเขียนเพื่อรับรายได้)
          </p>
          <p>
            ข้อมูลการทำธุรกรรม เช่น ข้อมูลการชำระเงิน ยอดชำระเงิน
          </p>
          <p>
            ข้อมูลทางเทคนิค ได้แก่ คุกกี้ Device ID และ IP Address
          </p>
          <p>
            ข้อมูลเกี่ยวกับพฤติกรรม เช่น ประวัติการชำระเงิน ประวัติการแลกของ
            ประวัติการค้นหา และประวัติการเข้าใช้งาน
          </p>
          <h4 class="mt-4">
            บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของท่าน
          </h4>
          <p>
            บริษัทอาจเปิดเผยข้อมูลของท่านให้กับผู้ให้บริการของบริษัท
            ที่ปรึกษาด้านการตลาดและหน่วยงานที่กำกับดูแล
            ทั้งนี้การรับส่งข้อมูลทางอินเตอร์เน็ตยังคงมีข้อจำกัดในการดูแลรักษาความปลอดภัย
            แม้บริษัทจะมีมาตรการรักษาความปลอดภัยของข้อมูลอย่างเข้มงวดแล้วก็ตาม
            บริษัทจึงไม่อาจรับประกันความปลอดภัยของข้อมูลที่ท่านเปิดเผยผ่านช่องทางออนไลน์ได้
            ดังนั้นบริษัทจะไม่รับผิดชอบต่อความสูญเสียที่เกิดขึ้น
            เว้นแต่ในกรณีที่บริษัทเป็นผู้ละเลย
          </p>
          <h4 class="mt-4">
            ระยะเวลาในการเก็บข้อมูลส่วนบุคคล
          </h4>
          <p>
            บริษัทจะทำการจัดเก็บข้อมูลส่วนบุคคลของท่านไว้ในระหว่างที่ท่านเป็นผู้ใช้บริการ
            หรือตลอดระยะเวลาเท่าที่จำเป็น
          </p>
          <h4 class="mt-4">นโยบายเกี่ยวกับคุกกี้</h4>
          <p>
            เมื่อท่านเข้าใช้เว็บไซต์ของบริษัท
            บริษัทจะเก็บรวบรวมข้อมูลจากท่านผ่านการใช้คุกกี้
            เพื่อช่วยให้บริษัททราบข้อมูลการเข้าใช้บริการของท่าน
            โดยบริษัทจะนำข้อมูลไปพัฒนาประสิทธิภาพในการเข้าถึงบริการของท่านให้ดียิ่งขึ้น
            ซึ่งบริษัทจะไม่ใช้ข้อมูลส่วนนี้เพื่อประโยชน์อื่น
            นอกจากพัฒนาบริการของบริษัทเอง
          </p>
          <h4 class="mt-4">
            สิทธิของเจ้าของข้อมูลส่วนบุคคล
          </h4>
          <p>
            ท่านมีสิทธิในการขอเพิกถอนความยินยอมที่จะให้บริษัทเก็บรวบรวม
            ใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน ณ เวลาใดก็ได้
          </p>
          <p>
            ท่านมีสิทธิในการเข้าถึงหรือขอสำเนาเกี่ยวกับข้อมูลส่วนบุลคล
            ที่บริษัทเก็บรวบรวมหรือใช้ข้อมูลของท่าน
          </p>
          <p>
            ท่านมีสิทธิในการแก้ไขข้อมูลส่วนบุคคลของท่านให้ถูกต้อง เป็นปัจจุบัน
            หรือเพิ่มเติมข้อมูลให้สมบูรณ์
          </p>
          <p>
            ท่านมีสิทธิในการขอให้บริษัทลบ ทำลาย
            หรือทำให้ข้อมูลส่วนบุคคลนั้นเป็นข้อมูลที่ไม่สามารถระบุตัวตนที่เป็นเจ้าของข้อมูลได้
          </p>
          <p>
            ท่านมีสิทธิในการคัดค้านและระงับบริษัทไม่ให้ประมวลผลข้อมูลส่วนบุคคลของท่านด้วยเหตุผลบางประการ
          </p>
          <p>
            ท่านมีสิทธิในการขอให้บริษัทส่งหรือโอนข้อมูลส่วนบุคคลของท่านไปยังผู้ควบคุมข้อมูลส่วนบุคคลอื่นโดยตรง
            เว้นแต่มีเหตุผลอื่นใดที่บริษัทไม่สามารถดำเนินการได้
          </p>
          <p>
            ท่านมีสิทธิในการร้องเรียนไปยังหน่วยงานที่มีอำนาจ
            ในกรณีที่บริษัทหรือลูกจ้างของบริษัท
            กระทำการฝ่าฝืนหรือไม่ปฏิบัติตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
          </p>
          <h4 class="mt-4">
            การเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
          </h4>
          บริษัทอาจมีการแก้ไขนโยบายเป็นครั้งคราวเพื่อให้สอดคล้องกับวัตถุประสงค์การให้บริการของบริษัทหรือตามกฎหมายที่เกี่ยวข้อง
          ทั้งนี้ หากมีการเปลี่ยนแปลงนโยบายความเป็นส่วนตัว
          การเปลี่ยนแปลงนโยบายดังกล่าวจะถูกประกาศไว้เว็บไซต์ของบริษัท
          นโยบายความเป็นส่วนตัวนี้ปรับปรุงล่าสุดเมื่อเดือนมิถุนายน 2565
          ช่องทางการติดต่อ หากท่านต้องการที่จะใช้สิทธิในความเป็นเจ้าของข้อมูล
          หรือหากมีข้อสงสัย ท่านสามารถติดต่อได้ตามช่องทางต่อไปนี้
          <p>
            บริษัท คิงด้อม แพลตฟอร์ม จำกัด ที่อยู่: 123 หมู่ 4 ตำบลห้วยเขน
            อำเภอบางมูลนาก จังหวัดพิจิตร 66120
          </p>
          <p>E-mail: contact@novelkingdom.co</p>
        </div>
      </div>
    </div>
  </div>
</template>
<style lang="scss" scoped>
.box-home-novel{
    font-family: "Sarabun", sans-serif;
        line-height: 1.9;
}
h4{
  font-size:23px;
  font-weight: 600;
}
.mt-4{
  margin-top: 40px;
}
</style>