<template>
    <div>
        <div class="b-mo">
            คู่มือโปรโมชั่น
        </div>
        <div class="nv-box-white">

        <div class="">
          <div class="text">
            1. โปรโมชั่น ตั้งแต่ตอนที่ xxx ถึงตอนที่ xxx ลดเหลือตอนละ xxx เหรียญ 
            <p class="exam">ตัวอย่างเช่น</p>
            <div class="title">ซื้อนิยายเป็นชุดตั้งแต่ตอนที่ 100 ถึงตอนที่ 200 ลดเหลือตอนละ 2.5 เหรียญ (ปกติตอนละ 3 เหรียญ)</div>
            <div class="detail">
             <p class="false">ในกรณีที่ไม่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 1 ซื้อยกชุด 99 ตอนหรือน้อยกว่า <br>
              วิธีการคำนวนยอดเหรียญที่ใช้ = 99 * 3 = 297 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย = ยอดเหรียญที่ใช้)
              <p class="end-false">*ดังนั้นการซื้อ 99 ตอนหรือน้อยกว่า จึงไม่เข้าเงื่อนไขของโปรโมชั่น*</p>
              <p class="true">ในกรณีที่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 2 ซื้อยกชุดตอนที่ 100 ถึงตอนที่ 200 ได้ส่วนลดเหลือตอนละ 2.5 เหรียญ 
              ตัวอย่างเช่น ซื้อยกชุดตอนที่ 151 ถึงตอนที่  200 ของนิยายที่จัดโปรโมชั่น
              วิธีการคำนวนยอดเหรียญปกติ           = 50 * 3 = 150 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย =  ยอดราคาเหรียญปกติ)
              วิธีการคำนวนยอดเหรียญโปรโมชั่น    = 50 * 2.5 = 125 เหรียญ (ยอดเหรียญที่ใช้ - ส่วนลดเหรียญ = ยอดราคาเหรียญทั้งหมด)
              วิธีการคำนวนส่วนลด                       = 150 - 125 = 25 เหรียญ (ยอดราคาเหรียญปกติ - ยอดราคาเหรียญทั้งหมด = จำนวนส่วนลด)
              <p class="end-true">*ดังนั้นการซื้อเป็นชุดในช่วงตอนโปรโมชั่น จึงเข้าเงื่อนไขโปรโมชั่นเเละช่วยลดราคาเหรียญ*</p>
            </div>
          </div>
         
      </div>

        <div class="">
          <div class="text">
            2. โปรโมชั่น ซื้อยกชุดครบ xxx ตอนหรือมากกว่า ลด xxx เหรียญ 
            <p class="exam">ตัวอย่างเช่น</p>
            <div class="title">ซื้อนิยายยกชุดครบ 100 ตอนหรือมากกว่า ลด 20 เหรียญ (ปกติตอนละ 3 เหรียญ)</div>
            <div class="detail">
              <p class="false">ในกรณีที่ไม่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 1 ซื้อยกชุด 99 ตอนหรือน้อยกว่า 
              วิธีการคำนวนยอดเหรียญที่ใช้ = 99 * 3 = 297 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย = ยอดเหรียญที่ใช้)
              <p class="end-false">*ดังนั้นการซื้อ 99 ตอนหรือน้อยกว่า จึงไม่เข้าเงื่อนไขของโปรโมชั่น*</p>
              <p class="true">ในกรณีที่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 2 ซื้อยกชุด 100 ตอนหรือมากกว่า ได้ส่วนลดทั้งหมด 20 เหรียญ จากราคาเหรียญทั้งหมด
              ตัวอย่างเช่น ซื้อยกชุด 100 ตอนของนิยายที่จัดโปรโมชั่น
              วิธีการคำนวนยอดเหรียญปกติ     = 100 * 3 = 300 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย =  ยอดราคาเหรียญ)
              วิธีการคำนวนยอดเหรียญรวมส่วนลดทั้งหมด  = 300 - 20 = 280 เหรียญ (ยอดเหรียญที่ใช้ - ส่วนลดเหรียญ = ยอดราคาทั้งหมด) 
              <p class="end-true">*ดังนั้นการซื้อ 100 ตอนหรือมากกว่า จึงเข้าเงื่อนไขโปรโมชั่นเเละช่วยลดราคาเหรียญ*</p>

            </div>
          </div>
           
      </div>

      <div class="">
          <div class="text">
            3. ซื้อยกชุดครบ xxx ตอนหรือมากกว่า ลด xxx%  
            <p class="exam">ตัวอย่างเช่น</p>
            <div class="title">ซื้อนิยายยกชุดครบ 100 ตอนหรือมากกว่า ลด 5%  (ปกติตอนละ 3 เหรียญ)</div>
            <div class="detail">
              <p class="false">ในกรณีที่ไม่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 1 ซื้อยกชุด 99 ตอนหรือน้อยกว่า 
              วิธีการคำนวนยอดเหรียญที่ใช้ = 99 * 3 = 297 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย = ยอดเหรียญที่ใช้)
              <p class="end-false">*ดังนั้นการซื้อ 99 ตอนหรือน้อยกว่า จึงไม่เข้าเงื่อนไขของโปรโมชั่น*</p>
              <p class="true">ในกรณีที่เข้าเงื่อนไขโปรโมชั่น</p>
              กรณีที่ 2 ซื้อยกชุด 100 ตอนหรือมากกว่า ได้ส่วนลดทั้งหมด 5 % จากราคาเหรียญทั้งหมด
              ตัวอย่างเช่น ซื้อยกชุด 100 ตอนของนิยายที่จัดโปรโมชั่น
              วิธีการคำนวนยอดเหรียญปกติ      = 100 * 3 = 300 เหรียญ (จำนวนตอนที่ซื้อ * ราคาต่อตอนนิยาย =  ยอดเหรียญที่ใช้)
                      วิธีการคำนวนส่วนลด %      = 300 * 0.05 = 15 เหรียญ (ยอดเหรียญที่ใช้ * เปอร์เซ็นต์ = ยอดเหรียญที่ลดทั้งหมด)
              วิธีการคำนวนยอดเหรียญทั้งหมด  = 300 - 15 = 285 เหรียญ (ยอดเหรียญที่ใช้ - ยอดเหรียญที่ลดทั้งหมด = ยอดเหรียญทั้งหมด)
              <p class="end-true">*ดังนั้นการซื้อ 100 ตอนหรือมากกว่า จึงเข้าเงื่อนไขโปรโมชั่นเเละช่วยลดราคาเหรียญ*</p>

            </div>
          </div>
           
      </div>

        <div class="">
          <div class="text">
            4. โปรโมชั่น ซื้อยกชุดทุกตอน (ถึงตอนล่าสุด) ได้ส่วนลด xx% (ชื่อโปรโมชั่น)
            <p class="exam">ตัวอย่างเช่น</p>
            <div class="title">ซื้อยกชุดทุกตอน (ทั้งหมด 300 ตอน) ได้ส่วนลด 15% (ชื่อโปรโมชั่น)</div>
            <div class="detail">
              <p class="false">ในกรณีที่ไม่เข้าเงื่อนไขโปรโมชั่น</p>
                ในกรณีที่ไม่เข้าเงื่อนไขโปรโมชั่น
                กรณีที่ 1 ซื้อนิยายยกชุดจำนวน 200 ตอนจากทั้งหมด 300 ตอน
                <p class="end-false">*ดังนั้นการซื้อนิยายยกชุดไม่ครบทุกตอน จึงไม่เข้าเงื่อนไขของโปรโมชั่น*</p>
                  
                <p class="true">ในกรณีที่เข้าเงื่อนไขโปรโมชั่น</p>
                กรณีที่ 2 ซื้อนิยายยกชุดทุกตอนของนิยาย ได้ส่วนลด 15% (ตอนละ 3 เหรียญ)
                ตัวอย่างเช่น ซื้อนิยายครบ 300 ตอน จาก 300 ตอน
                วิธีการคำนวนยอดเหรียญปกติ    =  300 * 3  = 900 เหรียญ
                วิธีการคำนวนส่วนลด          =  900 * 0.15 = 135 เหรียญ 
                วิธีการยอดสุทธิ             =  900 - 135 =  765 เหรียญ
                <p class="end-true">*ดังนั้นการซื้อนิยายยกชุดทุกตอน จึงเข้าเงื่อนไขโปรโมชั่นเเละช่วยลดราคาเหรียญ*</p>

            </div>
          </div>
           
      </div>


        </div>
    </div>
</template>
<script lang="ts">
import Vue from 'vue'
export default Vue.extend({
   mounted(){
    window.scrollTo({ top: 0, behavior: 'smooth' })
  }
})
</script>

<style lang="scss" scoped>
.b-mo{
  background:  left 50px / 600px repeat #9556fb;
  width: auto;
  height: 80px;
  margin-top: -2px;
  display: flex;
  align-items: center;
  justify-content: center;
  color: #fff;
  font-size: 20px;
  
}
.con-layout{
  margin: auto;
  max-width: 1150px;
  height: 250vh;
  background: #fff;
  flex-direction: column;
}

.box-content {
  width: 750px;
  margin: 0px 200px;
}
.text {
  padding-top: 50px;
}
.detail{
  font-weight: 300;
}
.title {
  font-weight: 300;
  
}
.false{
  color: #ec2020;
  font-weight: 400;
}
.end-false {
  color: #ec2020;
  font-weight: 400;
}
.true{
  color: #059605;
  font-weight: 400;
}
.end-true{
  color: #059605;
  font-weight: 400;
}
.exam {
  color: #3c74db;
}
@media (max-width: 820px){
.box-content {
  margin: 0px 0px 0px 50px;
  width: 700px;
  font-size: 18px;
}
}
@media (max-width: 768px) {
.b-mo{
  margin-top: 40px;
}
.box-content {
  margin: 0px 0px 0px 30px;
  width: 700px;
}
}

@media (max-width: 415px){
.box-content {
  margin: 0px 0px 0px 20px;
  width: 350px;
  font-size: 12px;
}
}
</style>