<template>
  <div class="Conditions">
    <NovelModal classlist="modal-conditions" animation="modal-animation">
      <template v-slot:body>
        <div class="con-conditions">
       <div class="col-md-12">
         <div class="title-conditions">ข้อกำหนดและเงื่อนไขการใช้บริการ</div>
         <h2>สัญญาให้บริการแพลตฟอร์ม Novel Kingdom </h2><h1>บริษัท คิงด้อม แพลตฟอร์ม จำกัด</h1><p>สัญญาการให้บริการฉบับนี้ (ซึ่งต่อไปนี้จะเรียกว่า “สัญญา”) ได้ระบุถึงข้อกำหนดและเงื่อนไขในการใช้บริการเว็บไซต์ novelkingdom.co หรือแอปพลิเคชัน novelkingdom หรือช่องทางอื่น ๆ ที่อยู่ในรูปแบบข้อมูลอิเล็กทรอนิกส์ผ่านระบบอินเตอร์เน็ตภายใต้การควบคุมดูแลของบริษัทคิงด้อมแพลตฟอร์ม จำกัด แก่ผู้ใช้บริการ </p><h6 class="mb-3">ดังนั้นเมื่อท่านใช้บริการผ่านเว็บไซต์</h6><h3 class="mt-4">ข้อ 1. คำจำกัดความ</h3><p>“แพลตฟอร์ม” หมายถึง เว็บไซต์ novelkingdom.co หรือแอปพลิเคชัน novelkingdom หรือช่องทางอื่น ๆ ที่อยู่ในรูปแบบข้อมูลอิเล็กทรอนิกส์ผ่านระบบอินเตอร์เน็ตภายใต้การควบคุมดูแลของบริษัทคิงด้อมแพลตฟอร์ม จำกัด</p><p>“บริษัท,ผู้ให้บริการ” หมายถึง บริษัทคิงด้อมแพลตฟอร์ม จำกัด</p><p>“งานวรรณกรรม” หมายถึง งานเขียน รวมถึงงานอันมีลิขสิทธิ์อื่นใดที่เป็นส่วนประกอบของงานเขียนดังกล่าว</p><p>“งานวรรณกรรมอิเล็กทรอนิกส์” หมายถึง งานวรรณกรรมที่ได้รับการดัดแปลงให้อยู่ในรูปของข้อมูลอิเล็กทรอนิกส์</p><p>“ตัวกลางรับชำระเงิน” หมายถึง ตัวกลางรับชำระเงินแต่ละราย (เช่น Apple, Google, RIM เป็นต้น) ผู้ให้บริการ App Store หรือบุคคล องค์กร หรือเครือข่ายโทรศัพท์เคลื่อนที่ภายในประเทศ (เช่น True, DTAC, AIS เป็นต้น) หรือช่องทางการชำระเงินอื่นใดที่ได้รับชำระค่าดาวน์โหลดงานวรรณกรรมจากผู้ใช้บริการ</p><p>“ผู้ใช้บริการ” หมายถึง ผู้ใช้อุปกรณ์ไม่ว่าระบบปฏิบัติการใดรับข้อมูลอิเล็กทรอนิกส์ใด ๆ ก็ตามของแพลตฟอร์ม ซึ่งสามารถเข้าถึง จัดเก็บหรือเผยแพร่งานวรรณกรรมอิเล็กทรอนิกส์ของแพลตฟอร์มได้</p><p>“นักเขียน” หมายถึง ผู้ใช้บริการในส่วนของการจัดเก็บและเผยแพร่วรรณกรรมอิเล็กทรอนิกส์</p><p>“นักอ่าน” หมายถึง ผู้ใช้บริการในส่วนที่สามารถเข้าถึง อ่าน หรือดาวน์โหลดงานวรรณกรรมอิเล็กทรอนิกส์ใด ๆ ของแพลตฟอร์ม</p><h3 class="mt-4">ข้อ 2. ข้อกำหนดการให้บริการ</h3><p>ผู้ให้บริการตกลงให้บริการดังต่อไปนี้</p><p>2.1 บริษัทให้บริการเขียน อ่าน หรือขาย งานวรรณกรรมอิเล็กทรอนิกส์</p><p>2.2 จัดเตรียมและดูแลรักษาระบบ เครื่องแม่ข่ายหรือ Server ที่จำเป็น เพื่อให้ผู้นักเขียนใช้สำหรับ</p><p>2.3.1 จัดเก็บวรรณกรรมอิเล็กทรอนิกส์และสามารถเผยแพร่งานวรรณกรรมไปยังนักอ่าน</p><p>2.3.2 เรียกชำระค่าวรรณกรรมจากนักอ่าน แล้วให้นักอ่านสามารถดาวน์โหลดและอ่านงานวรรณกรรมของนักเขียนผ่านอุปกรณ์ที่ใช้ระบบปฏิบัติการต่าง ๆ</p><p>2.3 จัดทำและพัฒนา ในระบบปฏิบัติการต่าง ๆ รวมถึงเว็บไซต์ เพื่อให้นักเขียนสามารถนำงานวรรณกรรมเผยแพร่ไปยังนักอ่าน</p><p>2.4 ประสานงานกับตัวกลางรับชำระเงินต่างๆ เพื่ออำนวยความสะดวกในการเผยแพร่และดาวน์โหลดงานวรรณกรรมของผู้ใช้บริการ</p><p>2.5 จำหน่ายวรรณกรรมอิเล็กทรอนิกส์ผ่านเว็บไซต์ และแอพลิเคชันในระบบปฏิบัติการต่าง ๆ </p><p>2.6 ทำหน้าที่เข้ารหัสแฟ้มข้อมูลวรรณกรรมอิเล็กทรอนิกส์ที่นักเขียนส่งให้แก่นักอ่านให้มีความปลอดภัยจากการลักลอบใช้งานและการโจรกรรมทางวรรณกรรม</p><p>2.7 ช่วยอำนวยความสะดวกและตอบข้อซักถามแก่ผู้ใช้บริการ</p><p>2.8 จัดทำระบบรายงานการขายวรรณกรรมอิเล็กทรอนิกส์ขึ้นบนหน้า Website (เว็บไซต์) ของผู้ให้บริการ </p><p>2.9 จัดทำรายงานเพื่อแจ้งจำนวนครั้งของการอ่านรวมถึงซื้องานวรรณกรรมอิเล็กทรอนิกส์ในแต่ละช่องทางให้แก่นักเขียน</p><p>2.10 จัดให้มีระบบรักษาความปลอดภัยเพื่อป้องกันการละเมิดลิขสิทธิ์ของนักเขียนโดยใช้เทคโนโลยีที่ได้มาตรฐานเป็นที่ยอมรับในวงการธุรกรรมระบบอิเล็กทรอนิกส์ในช่วงระยะเวลาที่ให้บริการ</p><h3 class="mt-4">ข้อ 3. คำรับรองของนักเขียน</h3><p>3.1 นักเขียนขอรับรองว่า นักเขียนเป็นผู้สร้างสรรค์และเป็นเจ้าของลิขสิทธิ์และ/หรือเป็นผู้ได้รับอนุญาตให้ใช้สิทธิอย่างถูกต้องในงานวรรณกรรมตามที่ได้มีการแจ้งไว้ และมีสิทธิโดยชอบที่จะอนุญาตให้บริษัทดำเนินการตามที่มอบหมายหรืออนุญาตภายใต้ข้อตกลงแห่งสัญญานี้</p><p>3.2 นักเขียนขอรับรองว่า งานวรรณกรรมของนักเขียนไม่มีเนื้อหาที่ผิดกฎหมาย ทั้งนี้ในกรณีที่มีบุคคลอื่นฟ้องร้องหรือใช้สิทธิจะฟ้องร้องเกี่ยวกับงานวรรณกรรมของนักเขียนหรือหากบริษัทตรวจสอบพบว่างานวรรณกรรมไม่เป็นไปตามคำรับรองนี้ นักเขียนยินดีหยุดเผยแพร่งานวรรณกรรม</p><p>3.3 นักเขียนรับทราบว่าบริษัทไม่ได้ทราบถึงเนื้อหาของงานวรรณกรรม และไม่สามารถแก้ไขหรือดัดแปลงเนื้อหาในงานวรรณกรรมของนักเขียนได้ ทุก ๆ ส่วนของงานวรรณกรรมเป็นความรับผิดชอบของนักเขียนแต่เพียงผู้เดียวที่จะรับผิดและปกป้องบริษัทในกรณีที่มีการร้องเรียน หรือมีการดำเนินการตามกฎหมายเกี่ยวกับงานวรรณกรรมของนักเขียน</p><h3 class="mt-4">ข้อ 4. คำรับรองของบริษัท</h3><p>4.1 บริษัทขอรับรองว่าได้จัดให้มีระบบรักษาความปลอดภัยที่ได้มาตรฐานการป้องกันการละเมิดลิขสิทธิ์ของนักเขียนและใช้ความรู้ความสามารถอย่างเต็มที่ในการดำเนินการเพื่อให้บรรลุวัตถุประสงค์ภายใต้ข้อตกลงการให้บริการนี้</p><p>4.2 บริษัทจะจัดทำเพื่อให้นักอ่านสามารถอ่านผ่าน Application โดยไม่ลอกเลียนงานของผู้อื่นและมิได้ละเมิดลิขสิทธิ์ สิทธิความเป็นส่วนตัว หรือสิทธิอื่นใดของบุคคลภายนอก และโดยไม่ผิดกฎหมายที่ใช้บังคับอยู่</p><p>4.3 เมื่อมีการเลิกข้อตกลง บริษัทจะทำลายสำเนางานวรรณกรรมหรือดำเนินการตามสมควรโดยประการอื่นใดตามคำสั่งของนักเขียน กรณีที่มีงานวรรณกรรมอิเล็กทรอนิกส์ที่ผู้ใช้บริการชำระเงินก่อนการเลิกข้อตกลง บริษัทจะเก็บงานวรรณกรรมไว้เพียงเพื่อให้นักอ่านที่เคยซื้ออ่านวรรณกรรมดังกล่าวสามารถอ่านเท่านั้น</p><p>4.4 บริษัทขอรับรองความถูกต้องสมบูรณ์ของรายงาน และจัดทำรายงานเพื่อแจ้งจำนวนครั้งของการอ่านและจำนวนเงินตามอัตราและเงื่อนไขที่ระบุไว้ในข้อ 6</p><h3 class="mt-4">ข้อ 5. ข้อจำกัดความรับผิด</h3><p>บริษัทจะใช้ความพยายามอย่างยิ่งในการดำเนินการภายใต้ข้อตกลงนี้ให้ปราศจากไวรัสและการรบกวนต่างๆ อย่างไรก็ดี ผู้ใช้บริการรับทราบว่า การสูญหาย การวิบัติ การจู่โจม ไวรัส การรบกวน การเจาะระบบ หรือการบุกรุกการรักษาความปลอดภัยอื่นๆจากบุคคลภายนอกเป็นสิ่งที่อยู่นอกเหนือการควบคุมของบริษัทและบริษัทไม่ต้องรับผิดที่เกี่ยวข้องกับการนั้น</p><h3 class="mt-4">ข้อ 6. การชำระรายได้จากการขาย</h3><p>6.1 การชำระรายได้จากการจำหน่ายงานวรรณกรรมอิเล็กทรอนิกส์ให้แก่นักเขียนตามข้อตกลงนี้ บริษัทจะรวบรวมข้อมูลการอ่าน และการชำระเงินในแต่ละเดือน สำหรับจัดทำรายงานเพื่อแจ้งจำนวนครั้งของการซื้อและจำนวนเงิน ให้เป็นไปตามอัตราและเงื่อนไขที่ระบุไว้ใน เอกสารแนบ 1 และแจ้งให้ผู้ใช้บริการทราบ ภายใน 45 (สี่สิบห้า) วัน ภายหลังวันปิดรอบระยะเวลาการรับชำระเงินในแต่ละเดือนแล้ว</p><p>6.2 หากรายได้จากการจำหน่ายงานวรรณกรรมอิเล็กทรอนิกส์ของผู้ใช้บริการมีมูลค่าน้อยกว่า 1,000 (หนึ่งพัน) บาท ให้ยกยอดรายได้นี้ไปรวมชำระในเดือนถัดไป ทั้งนี้ ผู้ให้บริการและผู้ใช้บริการทั้งสองฝ่ายต่างฝ่ายต่างรับภาระในภาษีอากรตามที่กฎหมายกำหนด (หากมี)</p><h3 class="mt-4">ข้อ 7. การคืนเงิน</h3><p>บริษัทขอสงวนสิทธิไม่คืนเงินหรือเหรียญที่ท่านได้ดำเนินการซื้อหรือแลกเปลี่ยนเสร็จสมบูรณ์แล้วทุกกรณี</p><h3 class="mt-4">ข้อ 8. สิทธิของบริษัทฯ</h3><p>8.1 บริษัทฯ ขอสงวนสิทธิ์ในการระงับ ลบผลงานหรือลบบัญชีของท่าน โดยไม่ต้องแจ้งล่วงหน้าหากบริษัทฯ พบว่าท่านได้ละเมิดหรือการกระทำใดๆ ที่ขัดกับเงื่อนไขแห่งสัญญานี้ ในกรณีที่มีการยกเลิกบริการดังกล่าว บริษัทฯอาจเพิกถอนการเข้าถึงบริการของท่านโดยไม่ต้องแจ้งให้ทราบและไม่คืนเงินค่าบริการ</p><p>8.2 บริษัทฯ ขอสงวนสิทธิ์ในการแก้ไขหรือเปลี่ยนแปลงเงื่อนไขการใช้บริการของบริษัทฯ โดยไม่ต้องแจ้งล่วงหน้าให้ผู้ใช้บริการทราบ ทั้งนโยบายส่วนบุคคล กฎหมายที่ใช้บังคับ ข้อกำหนดตามกฎระเบียบหรือการรักษาความปลอดภัย การเปลี่ยนแปลงทางเทคนิคในบริการของบริษัทฯ บริษัทฯ สงวนสิทธิ์ในการแจ้งการเปลี่ยนแปลงทั้งหมดและถือว่ามีผลบังคับใช้ทันที ดังนั้น โปรดตรวจสอบเงื่อนไขทุกครั้งที่ใช้บริการของบริษัทฯ กรณีท่านไม่ยอมรับเงื่อนไขที่เปลี่ยนแปลง ท่านจะไม่สามารถเข้าใช้บริการได้</p><h3 class="mt-4">ข้อ 9. การโอนสิทธิและหน้าที่</h3><p>ผู้ให้บริการตกลงจะไม่โอนสิทธิและหน้าที่ภายใต้ข้อตกลงนี้โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษรจากผู้ใช้บริการ เว้นแต่เป็นการโอนสิทธิและหน้าที่ให้แก่บริษัทลูกของผู้ให้บริการ และจะไม่กระทำการใดๆ ในงานวรรณกรรมตามข้อตกลงนี้ในลักษณะที่เป็นการกระทบกระเทือนถึงสิทธิของผู้ใช้บริการและก่อให้เกิดความเสียหายแก่ผู้ใช้บริการ</p><h3 class="mt-4">ข้อ 10. สิทธิของผู้ใช้บริการ</h3><p>10.1 ผู้ใช้บริการยังคงมีสิทธิในงานวรรณกรรมและทรัพย์สินทางปัญญาของผู้ใช้บริการทุกประการ</p><p>10.2 ผู้ใช้บริการมีสิทธิในการเข้าระบบรายงานการดาวน์โหลดงานวรรณกรรมอิเล็กทรอนิกส์และตรวจสอบรายได้ได้แบบ Real Time โดยใช้ Username และ Password ที่จัดให้มีขึ้นโดยผู้ให้บริการเพื่อผู้ใช้บริการได้ใช้ในการตรวจสอบข้อมูลเบื้องต้น</p><h3 class="mt-4">ข้อ 11. ข้อสงวนสิทธิของผู้ใช้บริการ</h3><p>ผู้ใช้บริการสามารถดำเนินการว่าจ้างบุคคลอื่นเพื่อขอรับบริการในลักษณะเดียวกันกับบริการที่ทำในข้อตกลงฉบับนี้เพื่อช่วยในการพัฒนาการให้บริการ</p><h3 class="mt-4">ข้อ 12. ข้อตกลงเบ็ดเตล็ด</h3><p>ข้อตกลงภายใต้เอกสารฉบับนี้เป็นความตกลงทั้งหมดระหว่างผู้ให้บริการและผู้ใช้บริการ และใช้บังคับระหว่างผู้ให้บริการและผู้ใช้บริการ ตลอดจนใช้บังคับแทนความตกลงที่มีขึ้นก่อนหน้านี้ระหว่างทั้งสองฝ่าย นอกจากนี้ผู้ให้บริการและผู้ใช้บริการอาจอยู่ภายใต้บังคับของข้อกำหนดและเงื่อนไขเพิ่มเติมที่จะมีผลบังคับใช้ต่อเมื่อมีการใช้บริการที่เกี่ยวข้องกับเนื้อหาของบุคคลภายนอกหรือซอฟต์แวร์ของบุคคลภายนอก หากส่วนหนึ่งส่วนใดของข้อตกลงฉบับนี้ถือว่าไม่สมบูรณ์หรือใช้บังคับไม่ได้ให้ส่วนนั้นได้รับการตีความในลักษณะที่สอดคล้องกับกฎหมายที่ใช้บังคับโดยให้สะท้อนถึงเจตนารมณ์เดิมของผู้ให้บริการและผู้ใช้บริการมากที่สุดเท่าที่จะเป็นไปได้และให้ส่วนที่เหลือมีผลบังคับใช้อย่างสมบูรณ์ต่อไป</p></div>
        </div>
        <div class="asd">
        <div class="round">
            <input
              type="checkbox"
              :checked="confirm"
              :value="confirm"
              @change="$emit('confirmConditions', {})"
              class="checkbox"
              id="checkbox"
            />
            <label for="checkbox"></label>
          </div>
          ยอมรับ
          </div>
      </template>
    </NovelModal>
  </div>
</template>
<script lang="ts">
import Vue from "vue";
export default Vue.extend({
  name:"Conditions",
  props:{
    confirm:Boolean
  },
  components:{
    NovelModal:()=> import('@/components/widget/NovelModal.vue')
  }
});
</script>
<style lang="scss" scoped>
.contai-modal{
        background: #000000c4 !important;

}
.con-conditions{
  font-family: "Sarabun", sans-serif;
  overflow-y: scroll;
  padding: 0px 40px;
  height: 100%;
}
h3 {
    color: #191e47;
    font-weight: 600;
    font-size: 18px;
    
    
    margin-top: 20px;
    margin-bottom: 10px;
}
h2{
  color: #191e47;
    font-weight: 600;
    font-size: 23px;
    margin-top: 20px;
    margin-bottom: 10px;
}
p{
  line-height: 1.8;
}
.title-conditions{
  text-align: center;
  font-weight: 600;
    font-size: 23px;
    color: #191e47;

}
.asd{
  display: flex;
  gap: 10px;
  padding: 0px 35px;
  text-align: right;
}
</style>

